#define _CRT_SECURE_NO_WARNINGS
#include "Header.h"
#include <assert.h>

void showFCSNInfo() {
	printf("Факультет компьютерных систем и сетей(ФКСИС) \n\n");
	printf("Декан: Боброва Наталья Леонидовна \n");
	printf("кандидат технических наук, доцент \n");
	printf("Ауд.: 201-4\n");
	printf("Тел.: 292-42-85, 293-86-63\n");
	printf("E-mail: bobrova@bsuir.by\n\n");

	printf("История факультета компьютерных систем и сетей начинается с факультета автоматики и вычислительной техники (ФАВТ), который был создан в 1964 году. Первый выпуск специальности «Математические и счетно-решающие приборы и устройства» в составе 26 человек состоялся уже в декабре 1964 года. На базе ФАВТ в 1980 году был создан факультет вычислительной техники, переименованный в 1995 году в факультет компьютерных систем и сетей. Только за 5 последних лет факультет выпустил более 2000 специалистов, востребованных в сфере информационных технологий. \n\n");
	printf("Сегодня факультет компьютерных систем и сетей является одним из ведущих факультетов в Республике Беларусь по подготовке IТ-специалистов. По результатам исследований рынка труда белорусской ИТ-индустрии, регулярно проводимых Парком высоких технологий, с 2010 года ФКСиС уверенно занимает первое место среди факультетов вузов Беларуси, выпускники которых востребованы в ПВТ. \n\n");
	printf("На сегодняшний день это самый крупный факультет университета, на котором обучаются более двух тысяч студентов. В состав факультета входят 7 кафедр, из них 4 выпускающие: «Электронных вычислительных машин», «Информатики», «Программного обеспечения информационных технологий», «Электронных вычислительных средств». На факультете работают более 200 преподавателей, из них 14 докторов, профессоров, 88 кандидатов наук, доцентов. Среди них доктор технических наук, профессор Татур М.М., доктор технических наук, профессор Ярмолик В.Н., доктор технических наук, профессор Иванюк А.А., доктор технических наук, профессор Петровский А.А., доктор физико-математических наук, профессор Л.И. Минченко, хорошо известные как в Беларуси, так и за рубежом. \n\n");
	printf("Кафедры факультета компьютерных систем и сетей установили тесные партнерские отношения с рядом университетов России, США, Западной Европы и Австралии, а также тесно сотрудничают с ведущими в отрасли IТ-технологий компаниями IBM, Microsoft, SAP, National Instruments, Cisco, NVidia, EMC, Texas Instruments, Oracle, Яндекс, 1С. \n\n");
	printf("Среди наград факультета - престижная премия IBM Faculty Awards, завоеванная Академическим центром компетенции технологий IBM, Belarusian IT Awards в номинации «Кафедра», завоеванная кафедрой информатики, диплом Интернет-премии «ТИБО-2015» в номинации «Образование и наука», который принес веб-портал ФКСиС. \n\n");

	printf("Выпускники факультета получают одну из 3 квалификаций: инженер-программист, инженер-системный программист, инженер-системотехник \n\n");
	printf("По желанию студенты факультета имеют возможность получить дополнительную военную специальность и стать офицерами запаса. \n\n");

	printf("Студенты факультета глубоко изучают технологии и языки программирования (Pascal, C/C++, Assembler, C#, Java, .NET и др.), системы управления базами данных (MySQL, MS SQL Server, Oracle и др.), web-технологии (HTML, CSS, XML, PHP и др.), методологию управления программными проектами, технологии разработки и тестирования программного обеспечения, архитектуру вычислительных машин и систем, программное и аппаратное обеспечение компьютерных сетей, а также широкий ряд иных специальных дисциплин. \n\n");
	printf("Наши студенты получают серьезную теоретическую и практическую подготовку, для чего на факультете созданы все условия. На факультете функционируют 13 совместных лабораторий, созданных совместно с ведущими IT-компаниями и банковскими учреждениями Беларуси: IBA, EPAM, Itransition, EffectiveSoft, ScienceSoft, Системные технологии, Приорбанк, Exadel, Численные методы, NT Lab, МиСофт. \n\n");
	printf("Подготовка специалистов на первой ступени высшего образования осуществляется по 4 востребованным в сфере IT-технологий специальностям: \n");
	printf("\tВычислительные машины, системы и сети \n");
	printf("\tИнформатика и технологии программирования \n");
	printf("\tПрограммное обеспечение информационных технологий \n");
	printf("\tЭлектронные вычислительные средства \n\n");
	printf("Факультет компьютерных систем и сетей - это интеллект, уверенность, успех. Выбрав наш факультет - ты реализуешь свою мечту! \n\n");
}
void showFITMInfo() {
	printf("Факультет информационных технологий и управления (ФИТУ) \n\n");
	printf("Факультет является ровесником университета. Сегодня - это крупный учебный и научный центр, в котором обучается более 1700 студентов, есть свои научные школы, функционирует магистратура, аспирантура и докторантура. Обучение ведется по четырем перспективным специальностям: «Автоматизированные системы обработки информации», «Искусственный интеллект», «Информационные технологии и управление в технических системах», «Промышленная электроника».\n");
	printf("На ФИТУ готовят специалистов широкого профиля по IТ-технологиям, которые без труда займут достойное место на рынке труда. \n\n");

	printf("Специальности:\n");
	printf("\tАвтоматизированные системы обработки информации \n");
	printf("\tИнформационные технологии и управление в технических системах \n");
	printf("\tИскусственный интеллект \n");
	printf("\tИнформационные системы и технологии (в игровой индустрии) \n");
	printf("\tПромышленная электроника \n\n");
}
void showFREEInfo() {
	printf("Факультет радиотехники и электроники (ФРЭ) \n\n");
	printf("Современная радиоинформационная система предназначена для извлечения, формирования, приема, передачи и обработки информации. Для решения названных задач необходимы специалисты, всесторонне подготовленные для работы с современными микро - и наноэлектронными устройствами, способные применить свои знания и талант для создания принципиально новых поколений информационных систем.\n\n");

	printf("Специальности:\n");
	printf("\tКвантовые информационные системы\n");
	printf("\tМикро- и наноэлектронные технологии и системы \n");
	printf("\tНанотехнологии и наноматериалы в электронике \n");
	printf("\tРадиоинформатика \n");
	printf("\tРадиотехника(программируемые радиоэлектронные средства) \n");
	printf("\tРадиоэлектронные системы \n");
	printf("\tРадиоэлектронная защита информации \n");
	printf("\tПрофессиональное обучение (информатика) \n");
	printf("\tЭлектронные и информационно-управляющие системы физических установок \n\n");
}
void showFCADInfo() {
	printf("Факультет компьютерного проектирования (ФКП) \n\n");
	printf("Специальности факультета тесно связаны между собой и ориентированы на подготовку высококвалифицированных специалистов, которые в процессе обучения осваивают самые современные средства и методы проектирования электронных систем, мобильных систем, программно - управляемых систем и комплексов, изделий электронно - оптической и медицинской техники.Студенты получают фундаментальные знания по основам алгоритмизации и программирования, бизнеса и права в информационных технологиях, защиты информации, операционным системам, компьютерным сетям, языкам программирования(Pascal, C, C++, C#, Java, Prolog, Ruby, Python, HTML, XML, SQL, UML и др.), программированию сетевых приложений, базам данных, системному анализу и управлению;  изучают визуальные средства разработки программных приложений, средства и технологии анализа и разработки информационных систем, распределенные информационные системы, web - дизайн и шаблоны проектирования, экономико - математические методы и модели, бизнес - анализ и эконометрику. \n\n");
	printf("Получая классическое университетское образование, а также серьезную подготовку в области самых современных IT-технологий, выпускники всех специальностей факультета являются одними из самых востребованных и высокооплачиваемых, а лучшие из них занимают руководящие должности как в органах государственного управления, так и в сфере IT - бизнеса, промышленности и банковской системе, часто выступают в качестве руководителей и организаторов производства, создают собственные фирмы.\n\n");
	printf("Специальности:\n");
	printf("\tИнженерно-психологическое обеспечение информационных технологий \n");
	printf("\tИнформационные системы и технологии в обеспечении промышленной безопасности \n");
	printf("\tМедицинская электроника \n");
	printf("\tМоделирование и компьютерное проектирование радиоэлектронных средств \n");
	printf("\tПрограммно-управляемые электронно-оптические системы \n");
	printf("\tПроектирование и производство программно-управляемых электронных средств\n");
	printf("\tЭлектронные системы безопасности\n");
	printf("\tИнформационные системы и технологии (в бизнес-менеджменте) \n");
	printf("\tПрограммируемые мобильные системы \n\n");
}
void showFICInfo() {
	printf("Факультет инфокоммуникаций(ФИК) \n\n");
	printf("Факультет инфокоммуникаций обеспечивает современное образование тем, кого влечет электроника и информатика, кто желает освоить инновационные электронные и информационные технологии в телекоммуникациях, кто стремиться быть востребованным в современных социальных и экономических условиях.\n\n");
	printf("Студенты факультета получают глубокие знания в области информационно-коммуникационных технологий, имеют навыки разработки и внедрения новых технологий в инфокоммуникациях, что делает выпускников конкурентоспособными в рыночных условиях производства и позволяет быстрее адаптироваться к повышенным научно-техническим задачам развития отрасли инфокоммуникаций.\n\n");
	printf("Специальности:\n");
	printf("\tЗащита информации в телекоммуникациях \n");
	printf("\tИнфокоммуникационные системы (стандартизация, сертификация и контроль параметров) \n");
	printf("\tИнфокоммуникационные технологии (сети инфокоммуникаций) \n");
	printf("\tИнфокоммуникационные технологии (системы распределения мультимедийной информации) \n");
	printf("\tИнфокоммуникационные технологии (системы телекоммуникаций) \n");
	printf("\tИнфокоммуникационные технологии (цифровое теле- и радиовещание)\n\n");
}
int chooseFaculty(int langScore, int mathScore, int physicsScore, double certificateScore) {
	int res = langScore + mathScore + physicsScore + (int)round(certificateScore * 10);
	printf("%d \n", (int)res);
	if (res == 0) {
		printf("wrong input \n");
	}
	else if (res < 235) {
		printf("Hе тратьте время! Ваш балл слишком низкий! \n");
		if (langScore > physicsScore + 10 && langScore > mathScore + 10) {
			printf("Подумайте над гумманитарными специальностями \n");
		}
	}
	else if (res >= 235 && res < 264) {
		printf("Вы можете выбрать только ФРЭ \n");
	}
	else if (res >= 264 && res < 301) {
		printf("Вы можете выбрать только ФРЭ, ФИК \n");
	}
	else if (res >= 301 && res < 307) {
		printf("Вы можете выбрать только ФРЭ, ФИК, ФИТУ \n");
	}
	else if (res >= 307 && res < 318) {
		printf("Вы можете выбрать только ФРЭ, ФИК, ФИТУ, ФКП \n");
	}
	else if (res >= 318) {
		printf("Вы можете выбрать ФРЭ, ФИК, ФИТУ, ФКП, ФКСИС \n");
	}
	return res;
}
void showMenu() {
	printf("press 1 to konw information about FCSN \n");
	printf("press 2 to konw information about FITM \n");
	printf("press 3 to konw information about FREE \n");
	printf("press 4 to konw information about FCAD \n");
	printf("press 5 to konw information about FIC \n");
	printf("press 6 to choose faculty acording to your results \n");
	printf("press 7 to exit \n");
}
void taskBSUIRInfo() {
	int varient;
	showMenu();
	int langScore = 0, mathScore = 0, physicsScore = 0;
	double certificateScore = 0;
	while (scanf("%d", &varient)) {
		switch (varient) {
		case 1:
			showFCSNInfo();
			break;
		case 2:
			showFITMInfo();
			break;
		case 3:
			showFREEInfo();
			break;
		case 4:
			showFCADInfo();
			break;
		case 5:
			showFICInfo();
			break;
		case 6:
			printf("Enter your language score \n");
			if (scanf("%d", &langScore) == 1) {
				printf("Enter your math score \n");
				if (scanf("%d", &mathScore) == 1) {
					printf("Enter your physics score \n");
					if (scanf("%d", &physicsScore) == 1) {
						printf("Enter the certificate score \n");
						if (scanf("%Lf", &certificateScore) == 1) {
							chooseFaculty(langScore, mathScore, physicsScore, certificateScore);
						}
					}
				}
			}
			break;
		case 7:
			return;
		default:
			printf("wrong input");
			break;
		}
		showMenu();
	}
}
double findFact(double k) {
	double res = 1;
	if (k > 0 && k < 245) {
		double i;
		for (i = 1; i <= k; i++) {
			res *= i;
		}
	}
	else if (k >= 245) {
		assert("Number is too big to find factorial findFact(int k)");
	}
	else {
		assert("Wrong input k findFact(int k)");
	}
	return res;
}
double calculate(double x, int n) {
	return (double)(pow((-1), ((double) n - 1)) * pow(x, ((double)2 * n - 1))) / findFact(((double)2*n - 1));
}
double calculateRec(double x, int n, double res) {
	if (n > 0) {
		res += (double)(pow((-1), ((double)n - 1)) * pow(x, ((double)2 * n - 1))) / findFact(((double)2 * n - 1));
		return calculateRec(x, n - 1, res);
	}
	return   (double)(sin(x)) - res;
}
double findDif(double x, int n) {
	double res = 0;
	int i;
	for (i = 1; i <= n; i++) {
		res += calculate(x, i);
	}
	return (double)((sin(x)) - res);
}
int findN(double x, double eps) {
	int i = 0;
	double dif = 1.0*sin(x);
	while (fabs(dif) > eps) {
		i++;
		dif -= calculate(x, i);
	}
	return i;
}

int main() {
	setlocale(LC_ALL, "Russian");
	taskBSUIRInfo();

	double x;
	int n;
	if (scanf("%lf", &x) && scanf("%d", &n)) {
		printf("\n\n%.100f\n", findDif(x, n));
		printf("%.100f\n", calculateRec(x, n, 0.0));

	}

	double eps;
	if (scanf("%lf", &x) && scanf("%lf", &eps)) {
		printf("%d\n", findN(x, eps));
	}

	double x1 = -2 * 3.14;
	for (; x1 < 2 * 3.14; x1 += 0.1) {
		printf("%d\n", findN(x1, 0.001));
	}

	
	return 0;
}
